РУ
# โปรแกรมทายตัวเลข โดยมีการทำงานของโปรแกรมดังนี้ # - ให้ผู้ใช้ทายตัวเลขโดยการป้อนตัวเลขทางแป้นพิมพ์ # - โดยกรณีที่ตัวเลขที่ป้อนมีค่าเท่ากับ 59 - ให้แสดงข้อความ
"ยินดีด้วยคุณทายถูก"
# - แต่หากตัวเลขที่ป้อนมีค่ามากหรือน้อยกว่า 59ให้แสดงข้อความ "คุณทายผิดตัวเลขที่ป้อนมากไป" หรือ
"คุณทายผิดตัวเลขที่ป้อนน้อยไป" และให้ผู้ใช้ป้อนใหม่โดยโปรแกรมจะวนให้ผู้ใช้ป้อนไปเรื่อยๆ จนกว่าจะทายถูก
#****************************************
# **** ทายตัวเลขที่มีค่าอยู่ที่ 1 - 100 กันเถอะ ****
#***************************************米
# ป้อนตัวเลขที่ต้องการทาย : 25
# คุณทายผิดตัวเลขที่ป้อนน้อยไป
＃ ****************************************米
# ป้อนตัวเลขที่ต้องการทาย : 85
# คุณทายผิดตัวเลขที่ป้อนมากไป
#*****************************************
# ป้อนตัวเลขที่ต้องการทาย : 80
# คุณทายผิดตัวเลขที่ป้อนมากไป
# ********************************”
*米米米米水水米
# ป้อนตัวเลขที่ต้องการทาย : 59
# ยินดีด้วยคุณทายถูก
#*****************************************

while.True:
    print('**** ทายตัวเลขที่มีค่าอยู่ที่ 1 - 100 กันเถอะ')
    num = int(input('ป้อนตัวเลขที่ต้องการทาย : '))
    if num < 59:
        print('คุณทายผิดตัวเลขที่ป้อนน้อยไป')
    elif num > 59:
        print('คุณทายผิดตัวเลขที่ป้อนมากไป')
    else:
        print('ยินดีด้วยคุณทายถูก')
        break 
print('-------------------------------------')